// Напишите функцию которая получает на вход строку и переворачивает буквы в словах, оставляя слова на своих местах

// Пример:
// reverseLetters('Мама мыла раму') // => returns 'амаМ алым умар'


// Напишите функцию-калькулятор, которая получает на вход строку, содержащую 2 целых числа и арифметическую операцию (+*-/), и возвращает результат в виде числа.
// Пример:
// myCalculator('2 4 +') // => returns 6
// myCalculator('8 2 /') // => returns 4
// myCalculator('8 7 -') // => returns 1
// myCalculator('3 5 *') // => returns 15


// Напишите функцию поиска суммы максимального и минимального значения в массиве (не используя Math.max и Math.min)

// Пример:
// findMax([1, 12, 5, -6, 7, -8, -22, 3, -49, 0]) // => returns   -49 + 12 = -37


// Найдите сумму двух самых маленьких чисел в массиве.

// Пример
// [0,  1,  2, 3,  4]
// [19, 5, 42, 2, 77]  //  = > 7


// Дан массив городов.
// Напишите функцию, которая возвращает самое длинное название и следующее за ним.

// ['Москва', 'Саратов', 'Магнитогорск', 'Ухта', 'Псков', 'Киров'] => ['Магнитогорск','Саратов']


// Напишите функцию, которая принимает массив из 10 чисел и возвращает строку в виде телефонного номера.

// Пример:
// createPhoneNumber([1, 2, 3, 4, 5, 6, 7, 8, 9, 0]) // => returns "(123) 456-7890"


// Напишите функцию, которая принимает на вход строку и делает первую букву заглавной, а также проверяет есть ли в конце точка, если нет - добавляет.
// * привести всю остальную строку к нижнему регистру

// Пример:
// capitalized('маМа мЫлА рАмУ') // => returns "Мама мыла раму."


// Напишите функцию, которая принимает на вход строку и удаляет из неё все гласные буквы

// Пример:
// removeVowels('Мама Аня мыла раму. Папа Юра вымыл пол.') // => returns "Мм н мл рм. Пп р вмыл пл."